Ctrl + Enter will execute a cell

Shift + Enter will execute the current cell and move selection to below cell

Alt + Enter will execute and insert a new cell below

Key A will insert cell above

Key B will insert cell below

Key D D to delete

In [ ]:
print("Hello world")

In [ ]:
def hello():
    print("Hello world")

hello()

In [ ]:
# Many ways to do the same thing
apple = 5
orange = 3
print(f"There are {apple} apples and {orange} oranges. In total there are {apple + orange} fruits.")
print("There are {} apples and {} oranges. In total there are {} fruits.".format(apple,orange,apple + orange))
print("There are %s apples and %s oranges. In total there are %s fruits." % (apple,orange,apple + orange))

In [ ]:
var1 = "This is a simple text"
var1.split()

In [ ]:
",".join(var1.split())

In [ ]:
",".join(var1.split()).upper()

## Basic indexing in Python

First element starts at 0

End position is not included

```
a=[1,2,3]
a[0] -> 1
a[2] -> 3
a[0:2] -> [1,2]
```

In [ ]:
a=[1,2,3]

In [ ]:
a[0]

In [ ]:
a[2]

In [ ]:
a[0:2]

In [ ]:
b="Python is simple"

In [ ]:
b[2:4]

In [ ]:
b[:5]

In [ ]:
b[-4:]   # Length minus 4

In [ ]:
b[:-8]

In [ ]:
",".join(var1.split()[0:2]).upper()

## Condition

In [1]:
a = 1
if a==1:
    print("a is 1")

if a < 5:
    print("a is less than 5")

a is 1
a is less than 5

## Basic Loop

In [ ]:
range(10)

In [ ]:
for i in range(10):
    print(i)

In [ ]:
for i in range(2,10):
    print(i)

In [ ]:
for i in range(0,10,3):
    print(i)

# PANDAS AND NUMPY

In [1]:
import pandas as pd
import numpy as np

Numpy is only used here for creating a special type of array used by pandas

Only need **Numpy array** from Numpy library and **DataFrame** from Pandas :- 

- **Numpy array** is used to create **Pandas series** which is like a **column** in Excel. 
- Many **Pandas series** together make up a **Pandas Dataframe** which is like a **worksheet** in Excel

## Read csv file

In [2]:
pd.read_csv("input_csv.csv")

   id   name       dob
0   1    Bob  19800228
1   2  Alice  19851003
2   3  Carol  20000405

In [3]:
df1=pd.read_csv("input_csv.csv",dtype={"dob":str})
df1

   id   name       dob
0   1    Bob  19800228
1   2  Alice  19851003
2   3  Carol  20000405

In [4]:
def date_conv(x):
    return pd.to_datetime(str(x), format='%Y%m%d')

In [5]:
pd.read_csv("input_csv.csv",parse_dates=["dob"],date_parser=date_conv)#.info()

/var/folders/1_/_fd3466n5wg7yzpxczjr11l00000gn/T/ipykernel_29791/3841132580.py:1: FutureWarning: The argument 'date_parser' is deprecated and will be removed in a future version. Please use 'date_format' instead, or read your data in as 'object' dtype and then call 'to_datetime'.
  pd.read_csv("input_csv.csv",parse_dates=["dob"],date_parser=date_conv)#.info()

   id   name        dob
0   1    Bob 1980-02-28
1   2  Alice 1985-10-03
2   3  Carol 2000-04-05

## Indexing in pandas
#### Select row and column with iloc(row_range,column_range)

In [6]:
df1.iloc[2:3,1:3]

    name       dob
2  Carol  20000405

In [ ]:
df1.iloc[[0],:]

In [7]:
df1.iloc[:,[2]]

        dob
0  19800228
1  19851003
2  20000405

In [8]:
df1.loc[:,["dob"]]

        dob
0  19800228
1  19851003
2  20000405

In [9]:
df1[["name"]]

    name
0    Bob
1  Alice
2  Carol

In [ ]:
type(df1["name"])

In [ ]:
type(df1[["name"]])

## Read fixed width file

In [10]:
df2=pd.read_fwf("input_fwf.txt",colspecs=[(0,3),(3,24)],names=["id","email"])
df2

   id                 email
0   2  alice.work@email.com
1   3        carol@mail.com
2   2  alice.home@email.com
3   3      carol.g@mail.com
4   3     carol.f@gmail.com
5   4  some.one@nowhere.com

## Different types of merges

In [11]:
common=df1.merge(df2,on=["id"],how="inner")
common

   id   name       dob                 email
0   2  Alice  19851003  alice.work@email.com
1   2  Alice  19851003  alice.home@email.com
2   3  Carol  20000405        carol@mail.com
3   3  Carol  20000405      carol.g@mail.com
4   3  Carol  20000405     carol.f@gmail.com

In [12]:
df1.merge(df2,on=["id"],how="left",indicator=True)\
   .query("_merge=='left_only'")[["id","name","dob"]]\
   .to_csv("People without email.csv",index=False)

In [13]:
df1.merge(df2,on=["id"],how="right",indicator=True)\
   .query("_merge=='right_only'")[["id","email"]]\
   .to_csv("Orphan Emails.csv",index=False)

In [14]:
df1.merge(df2,on=["id"],how="outer",indicator=True)

   id   name       dob                 email      _merge
0   1    Bob  19800228                   NaN   left_only
1   2  Alice  19851003  alice.work@email.com        both
2   2  Alice  19851003  alice.home@email.com        both
3   3  Carol  20000405        carol@mail.com        both
4   3  Carol  20000405      carol.g@mail.com        both
5   3  Carol  20000405     carol.f@gmail.com        both
6   4    NaN       NaN  some.one@nowhere.com  right_only

## Concat two datasets

In [ ]:
df1

In [ ]:
df2=pd.read_csv("input_csv_2.csv",dtype={"dob":str})
df2

In [ ]:
pd.concat([df1,df2])

## Add a column to the dataframe

In [ ]:
common["email_caps"]=common["email"] \
                     .str.upper() \
                     .str.replace("@","")

In [ ]:
common

## Write a csv file

In [ ]:
common.to_csv("Common.csv",index=False)

## Write to a flat file

In [ ]:
np.savetxt("common-sql.txt",common["dob"],fmt="sql select '9abc',name from table where dob=%s")

***

# Group by, Transform, apply, applymap feature

## Group by

In [15]:
common

   id   name       dob                 email
0   2  Alice  19851003  alice.work@email.com
1   2  Alice  19851003  alice.home@email.com
2   3  Carol  20000405        carol@mail.com
3   3  Carol  20000405      carol.g@mail.com
4   3  Carol  20000405     carol.f@gmail.com

In [16]:
common.groupby(by=["id"])["email"].count()#.rename("count").reset_index()

id
2    2
3    3
Name: email, dtype: int64

Find the first of the group

In [19]:
common.groupby(by=['name']).first().reset_index()

    name  id       dob                 email
0  Alice   2  19851003  alice.work@email.com
1  Carol   3  20000405        carol@mail.com

## Apply a function column-wise or row-wise

In [ ]:
def str_cat(x):
    string=""
    for i in x:
        string = string + str(i)
    return string

In [ ]:
common.apply(str_cat,axis=0) # row wise

In [ ]:
common.apply(str_cat,axis=1) # column wise

## Apply a function on every cell in the dataframe

In [ ]:
def len_str(x):
    return len(str(x))

In [ ]:
common.applymap(len_str)

## Transform - apply a function on each group

In [ ]:
common["email_count"]=common.groupby(by=["id"])["email"].transform("count")

In [ ]:
common

## Using sqlite to store data in local tables like MS Access and use SQL

SQLite is a C-language library that implements a small, fast, self-contained, high-reliability, full-featured, SQL database engine.SQLite is the most used database engine in the world. SQLite is built into all mobile phones and most computers and comes bundled inside countless other applications that people use every day. 

Used in many applications. Can store upto 281 TB of data in a single database file. It is used in Chrome, Firefox, Safari, Android, iOS

Not suitable for parallel writes. But good for parallel reads. Great for local storage.

In [ ]:
import sqlite3
conn = sqlite3.connect("test.db")
cursor = conn.cursor()

In [ ]:
common.to_sql("customer",conn,if_exists="replace",index=False)

In [ ]:
pd.read_sql("SELECT * from customer where name = 'Alice'",conn)

In [ ]:
conn.execute("CREATE INDEX name_idx ON customer(name)").fetchall()

In [ ]:
cursor.execute("select * from SQLite_master").fetchall()

In [ ]:
cursor.close()
conn.close()

# Some useful Markup features in Jupyter Notebook

M will make a cell mark down and Y will make it code

#### Markup text can be written in cells. Heading can be written like below.

# Heading
## Heading smaller
### Even smaller
#### Smallest

***

Make text **bold** using **

Make text _italics_ using _

***

#### Links can be created like this

[Link](#Page-Bottom)

***

#### List can be created using hyphen

- Item 1
- Item 2
- Item 3

- [ ] Item 1
- [ ] Item 2
- [ ] Item 3

1. Numbered Item 1
2. Numbered Item 2
3. Numbered Item 3

#### Table can be created like below

|Header|Header|Header|
|------|------|----|
|A     |B     |C     |
|X     |Y     |Z     |

***

#### Note can be created like this

> This is something important

#### Monospaced text

```
01 WS-TEXT-1     PIC X(1)
01 WS-TEXT-2     PIC X(3)
01 WS-TEXT-3     PIC X(4)
```

***

#### Advanced formatting can be done using HTML

<div class="alert alert-block alert-info">
<b>Tip:</b> Use blue boxes (alert-info) for tips and notes. 
If it’s a note, you don’t have to include the word “Note”.
</div>

# Page Bottom